Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionBase.Modify Method
 The single dimension cannot be modified.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
An exception.
Exceptions
Exception | Condition
InvalidOperationException | Thrown always.
See Also
Reference
CurvedDimensionBase Class
Tekla.Structures.Drawing Namespace